# AssemblyName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AssemblyName Property
ParameterTypeId Class See Also
---
"Assembly Name"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AssemblyName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AssemblyName As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AssemblyName {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace